In [1]:
import pandas as pd   
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
%matplotlib inline

In [3]:
gdp_df = pd.read_csv("../data/gdp_percapita.csv", nrows=6868)

In [4]:
gdp_df.head()

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2019  2065.036398              NaN
1     Afghanistan  2018  2033.779002              NaN
2     Afghanistan  2017  2058.383832              NaN
3     Afghanistan  2016  2057.062164              NaN
4     Afghanistan  2015  2068.265904              NaN

In [5]:
internet_df = pd.read_csv("../data/internet_use.csv", nrows=4495)

In [6]:
internet_df.head()

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN

#### 98. Look at the shape of each DataFrame - how many rows? How many columns?

In [7]:
print(gdp_df.shape)

(6868, 4)

In [8]:
print(internet_df.shape)

(4495, 4)

#### 6.	Take a look at the datatypes for the columns in each DataFrame.

In [9]:
print(gdp_df.dtypes)

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

In [10]:
print(internet_df.dtypes)

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

#### 99. Take a look at the last 10 rows of each DataFrame in turn.

In [11]:
gdp_df.tail(10)

     Country or Area  Year        Value  Value Footnotes
6858        Zimbabwe  1999  3600.849291              NaN
6859        Zimbabwe  1998  3653.920016              NaN
6860        Zimbabwe  1997  3580.048793              NaN
6861        Zimbabwe  1996  3520.430146              NaN
6862        Zimbabwe  1995  3226.413930              NaN
6863        Zimbabwe  1994  3263.934978              NaN
6864        Zimbabwe  1993  3033.504852              NaN
6865        Zimbabwe  1992  3054.889178              NaN
6866        Zimbabwe  1991  3426.598094              NaN
6867        Zimbabwe  1990  3324.348171              NaN

In [12]:
internet_df.tail(10)

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

#### 7.	Drop the `value footnotes` column from both DataFrames. Check that this worked as expected.

In [13]:
gdp_df = gdp_df.drop(columns=['Value Footnotes'])

In [14]:
internet_df = internet_df.drop(columns=['Value Footnotes'])

#### 8.	Change the columns for the GDP Per Capita DataFrame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.

In [15]:
gdp_df.rename(
    columns={"Country or Area" : "Country",
                "Value":"GDP_Per_Capita"}
          ,inplace=True)

In [16]:
print(gdp_df.head())

       Country  Year  GDP_Per_Capita
0  Afghanistan  2019     2065.036398
1  Afghanistan  2018     2033.779002
2  Afghanistan  2017     2058.383832
3  Afghanistan  2016     2057.062164
4  Afghanistan  2015     2068.265904

#### 9.	Change the columns for the Internet Users DataFrame to ‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [17]:
internet_df.rename(
    columns={"Country or Area" : "Country",
                "Value":"Internet_Users_Pct"}
          ,inplace=True)

In [18]:
print(internet_df.head())

       Country  Year  Internet_Users_Pct
0  Afghanistan  2014            6.390000
1  Afghanistan  2013            5.900000
2  Afghanistan  2012            5.454545
3  Afghanistan  2011            5.000000
4  Afghanistan  2010            4.000000

#### 10.	Merge the two DataFrames to one. Merge **all rows** from each of the two DataFrames. Call the new DataFrame `gdp_and_internet_use`.

In [19]:
gdp_and_internet_use = pd.merge(gdp_df, internet_df, how='left', on=['Country','Year'])

In [20]:
print(gdp_and_internet_use)

          Country  Year  GDP_Per_Capita  Internet_Users_Pct
0     Afghanistan  2019     2065.036398                 NaN
1     Afghanistan  2018     2033.779002                 NaN
2     Afghanistan  2017     2058.383832                 NaN
3     Afghanistan  2016     2057.062164                 NaN
4     Afghanistan  2015     2068.265904                 NaN
...           ...   ...             ...                 ...
6863     Zimbabwe  1994     3263.934978            0.001739
6864     Zimbabwe  1993     3033.504852                 NaN
6865     Zimbabwe  1992     3054.889178                 NaN
6866     Zimbabwe  1991     3426.598094                 NaN
6867     Zimbabwe  1990     3324.348171            0.000000

[6868 rows x 4 columns]

### 11.	Look at the first five rows of your new DataFrame to confirm it merged correctly.

In [21]:
print(gdp_and_internet_use.head())

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2019     2065.036398                 NaN
1  Afghanistan  2018     2033.779002                 NaN
2  Afghanistan  2017     2058.383832                 NaN
3  Afghanistan  2016     2057.062164                 NaN
4  Afghanistan  2015     2068.265904                 NaN

##### 12.	Look at the last five rows to make sure the data is clean and as expected.

In [22]:
print(gdp_df.tail())

       Country  Year  GDP_Per_Capita
6863  Zimbabwe  1994     3263.934978
6864  Zimbabwe  1993     3033.504852
6865  Zimbabwe  1992     3054.889178
6866  Zimbabwe  1991     3426.598094
6867  Zimbabwe  1990     3324.348171

#### 13.	Subset the combined DataFrame to keep only the data for 2004, 2009, and 2014. Check that this happened correctly.

In [23]:
df_2004 = gdp_and_internet_use[gdp_and_internet_use.Year == 2004]
df_2009 = gdp_and_internet_use[gdp_and_internet_use.Year == 2009]
df_2012 = gdp_and_internet_use[gdp_and_internet_use.Year == 2012]

subset_df = pd.concat([df_2004, df_2009, df_2012])

print(subset_df)

                  Country  Year  GDP_Per_Capita  Internet_Users_Pct
15            Afghanistan  2004     1200.278256            0.105809
33                Albania  2004     7604.838002            2.420388
63                Algeria  2004    10058.435939            4.634475
93                 Angola  2004     5593.241537            0.464815
123   Antigua and Barbuda  2004    18745.681534           24.266544
...                   ...   ...             ...                 ...
6729              Vietnam  2012     5574.458880                 NaN
6759   West Bank and Gaza  2012     5985.683247                 NaN
6785                World  2012    14554.850133                 NaN
6815               Zambia  2012     3339.276135           13.468200
6845             Zimbabwe  2012     2932.081336           17.090000

[707 rows x 4 columns]

#### 14.	Create three new DataFrames, one for 2004, one for 2009, and one for 2014. Give them meaningful names that aren't too long.

#### already did this above to create subset (feeling like I did that question wrong)

15.	Which country had the highest percentage of internet users in 2014? What was the percentage? (Try typing the first 3 letters of your DataFrame name and hitting the tab key for auto-complete options).

In [24]:
df_2014 = gdp_and_internet_use[gdp_and_internet_use.Year == 2014]
df_2014.sort_values(
     by="Internet_Users_Pct",
     ascending=False,
    ) ##Iceland 98.16

                  Country  Year  GDP_Per_Capita  Internet_Users_Pct
2625              Iceland  2014    49652.149500               98.16
561               Bermuda  2014    77361.104881               96.80
4648               Norway  2014    62589.373548               96.30
1452              Denmark  2014    52214.537753               95.99
3691           Luxembourg  2014   108760.916030               94.67
...                   ...   ...             ...                 ...
6427               Tuvalu  2014     3450.793169                 NaN
6607  Upper middle income  2014    14275.343977                 NaN
6727              Vietnam  2014     6098.489609                 NaN
6757   West Bank and Gaza  2014     5967.073437                 NaN
6783                World  2014    15189.648507                 NaN

[238 rows x 4 columns]

#### 16.	Which country had the lowest percentage of internet users in 2014? What was the percentage?

In [25]:
df_2014.sort_values(
     by="Internet_Users_Pct",
     ascending=True,
    ) ##Timor_Lestec 1.14

                  Country  Year  GDP_Per_Capita  Internet_Users_Pct
6219          Timor-Leste  2014     3264.568070                1.14
827               Burundi  2014      886.235777                1.38
2326               Guinea  2014     2061.760973                1.72
4528                Niger  2014     1127.615541                1.95
5434         Sierra Leone  2014     1997.511853                2.10
...                   ...   ...             ...                 ...
6427               Tuvalu  2014     3450.793169                 NaN
6607  Upper middle income  2014    14275.343977                 NaN
6727              Vietnam  2014     6098.489609                 NaN
6757   West Bank and Gaza  2014     5967.073437                 NaN
6783                World  2014    15189.648507                 NaN

[238 rows x 4 columns]

#### 17. Repeat for 2004 and 2009.

In [27]:
min_int_2004 = df_2004.sort_values(
     by="Internet_Users_Pct",
     ascending=True,
    )
max_int_2004 = df_2004.sort_values(
     by="Internet_Users_Pct",
     ascending=False,
    )
min_int_2009 = df_2009.sort_values(
     by="Internet_Users_Pct",
     ascending=True,
    )
max_int_2009 = df_2009.sort_values(
     by="Internet_Users_Pct",
     ascending=False,
    )

print(min_int_2004) #Myanmar 0.024337
print(max_int_2004) #Sweden 83.89
print(min_int_2009) #Timor-Leste 0.185252
print(max_int_2009) #Iceland 93.00

                  Country  Year  GDP_Per_Capita  Internet_Users_Pct
4342              Myanmar  2004     1696.881760            0.024337
3545              Liberia  2004     1181.546158            0.031011
6079           Tajikistan  2004     1737.743630            0.077480
15            Afghanistan  2004     1200.278256            0.105809
1856             Ethiopia  2004      793.093786            0.155335
...                   ...   ...             ...                 ...
6437               Tuvalu  2004     3336.952920                 NaN
6617  Upper middle income  2004     8567.061394                 NaN
6737              Vietnam  2004     3689.732423                 NaN
6767   West Bank and Gaza  2004     4485.525458                 NaN
6793                World  2004    12077.823821                 NaN

[234 rows x 4 columns]
                  Country  Year  GDP_Per_Capita  Internet_Users_Pct
6019               Sweden  2004    44496.023401               83.89
2635              Iceland  2004    45145.545658               83.88
1462              Denmark  2004    50607.628971               80.93
4658               Norway  2004    60893.410993               77.69
2066              Finland  2004    43760.279146               72.39
...                   ...   ...             ...                 ...
6437               Tuvalu  2004     3336.952920                 NaN
6617  Upper middle income  2004     8567.061394                 NaN
6737              Vietnam  2004     3689.732423                 NaN
6767   West Bank and Gaza  2004     4485.525458                 NaN
6793                World  2004    12077.823821                 NaN

[234 rows x 4 columns]
                  Country  Year  GDP_Per_Capita  Internet_Users_Pct
6224          Timor-Leste  2009     2724.770973            0.185252
4337              Myanmar  2009     2874.780227            0.220000
5439         Sierra Leone  2009     1372.392285            0.260000
922              Cambodia  2009     2603.583778            0.530000
1851             Ethiopia  2009     1150.206179            0.540000
...                   ...   ...             ...                 ...
6194           The Gambia  2009     2283.183556                 NaN
6612  Upper middle income  2009    11212.934078                 NaN
6732              Vietnam  2009     4830.304958                 NaN
6762   West Bank and Gaza  2009     5250.116075                 NaN
6788                World  2009    13396.524163                 NaN

[236 rows x 4 columns]
                  Country  Year  GDP_Per_Capita  Internet_Users_Pct
2630              Iceland  2009    48177.084123               93.00
4653               Norway  2009    61886.564498               92.08
6014               Sweden  2009    45638.035577               91.00
4443          Netherlands  2009    51772.424928               89.63
3696           Luxembourg  2009   104932.811953               87.31
...                   ...   ...             ...                 ...
6194           The Gambia  2009     2283.183556                 NaN
6612  Upper middle income  2009    11212.934078                 NaN
6732              Vietnam  2009     4830.304958                 NaN
6762   West Bank and Gaza  2009     5250.116075                 NaN
6788                World  2009    13396.524163                 NaN

[236 rows x 4 columns]